app/views/posts/index.html.erb

SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('graph theory'))
---
          <div class="card-action">
            <%= raw post.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %>