app/controllers/posts_controller.rb

  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag])
    else
      @posts = Post.all
---
SELECT `posts`.* FROM `posts` JOIN taggings posts_taggings_5915669  ON posts_taggings_5915669.taggable_id = posts.id AND posts_taggings_5915669.taggable_type = 'Post' AND posts_taggings_5915669.tag_id = 1
SELECT `tags`.* FROM `tags` WHERE (LOWER(name) = LOWER('graph theory'))

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Hello this is my first post', 'The Tester was a serialized reality program created by Sony Computer Entertainment and produced by 51 Minds.[1] Notable as the first original live-action series distributed on a video game console,[2] it features eleven or twelve contestants, selected from thousands of applicants, competing in a variety of challenges to win a job at Sony Computer Entertainment in quality assurance as a game tester with a $5,000 signing bonus and a PlayStation 3 video game console. The winner of the third season also earned an opportunity to work at SCE Santa Monica Studio as a Production Associate on an unnamed PlayStation 3 title, a two-year lease on a 2012 Ford Focus Titanium edition and a Sony BRAVIA 3D Television. The first season launched in North America on February 18, 2010 and new episodes were released weekly until the finale aired on April 8, 2010. In its third season, the program is available as a free download exclusively on the PlayStation Network. Full seasons can also be streamed from the PlayStation website as well as from Crackle.', '2016-09-19 21:47:16', '2016-09-19 21:47:16')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `body` = 'The Tester was a serialized reality program created by Sony Computer Entertainment and produced by 51 Minds.[1] Notable as the first original live-action series distributed on a video game console,\r\n[2] it features eleven or twelve contestants, selected from thousands of applicants, competing in a variety of challenges to win a job at Sony Computer Entertainment in quality assurance as a game tester with a $5,000 signing bonus and a PlayStation 3 video game console. The winner of the third season also earned an opportunity to work at SCE Santa Monica Studio as a Production Associate on an unnamed PlayStation 3 title, a two-year lease on a 2012 Ford Focus Titanium edition and a Sony BRAVIA 3D Television. The first season launched in North America on February 18, 2010 and new episodes were released weekly until the finale aired on April 8, 2010. In its third season, the program is available as a free download exclusively on the PlayStation Network. Full seasons can also be streamed from the PlayStation website as well as from Crackle.', `updated_at` = '2016-09-22 19:54:24' WHERE `posts`.`id` = 1